toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS 
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the 
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2016 Renesas Electronics Corporation. All rights reserved.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_pdc_rx.c
 * Version      : 2.05
 * Description  : PDC module device driver
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.10.2016 2.00     First Release
 *         : 20.05.2019 2.02     Added support for GNUC and ICCRX.
 *                               Fixed coding style.
 *         : 30.07.2019 2.04     Added WAIT LOOP
 *         : 22.11.2019 2.05     Added support for atomic control.
 *                               Modified comment of API function to Doxygen style.
 ***********************************************************************************************************************/
/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 ***********************************************************************************************************************/
/* Access to peripherals and board defines. */
#include "platform.h"

/* Defines for PDC support */
#include "r_pdc_rx_if.h"
#include "src/r_pdc_rx_private.h"

/***********************************************************************************************************************
 Macro definitions
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 Typedef definitions
 ***********************************************************************************************************************/
/* This array holds callback functions. */
typedef void (*pcdfi_callback_t) (void *pdata);

/***********************************************************************************************************************
 Exported global variables (to be accessed by other files)
 ***********************************************************************************************************************/

/***********************************************************************************************************************
 Private variables and functions
 ***********************************************************************************************************************/
static bool is_opened = false; /* indicate whether PDC is opened */
static void * volatile ppcdfi_handlers; /* Pointer to event handler of PCDFI interrupt */
static pdc_cb_t cb_func; /* Pointer to callback functions */

/**
 * Private global function prototypes
 */
static void pdc_callback_receive_data_ready (void * pparam);
static void pdc_callback_frame_end (void * pparam);
static void pdc_callback_error (void * pparam);
static void pdc_error_processing (void);

static pdc_return_t pdc_reset (void);
static pdc_return_t pdc_initialize (pdc_data_cfg_t *p_data_cfg);
static pdc_return_t pdc_capture_start (void);
static pdc_return_t pdc_change_position_size (pdc_data_cfg_t *p_data_cfg);
static pdc_return_t pdc_int_setting (pdc_step_t step, pdc_data_cfg_t *p_data_cfg);
static pdc_return_t pdc_int_setting_sub (pdc_data_cfg_t *p_data_cfg);
static pdc_return_t pdc_clear_status (pdc_stat_t *p_stat);
static pdc_return_t pdc_get_status (pdc_stat_t *p_stat);
static void pdc_module_enable (void);
static void pdc_module_disable (void);

/**********************************************************************************************************************
 * Function Name: R_PDC_Open
 *****************************************************************************************************************/ /**
 * @brief This function initializes the PDC FIT module. It must be run before using the other API functions.
 * @param[in] *p_data_cfg
 *             Pointer to PDC settings data structure.\n 
 *             See section 3.1 in application note for members of referenced pdc_data_cfg_t structure and 
 *             their setting values.
 * @retval    PDC_SUCCESS         Processing finished successfully.
 * @retval    PDC_ERR_OPENED      R_PDC_Open has already been run.
 * @retval    PDC_ERR_INVALID_ARG Parameter values in PDC setting information are invalid.
 * @retval    PDC_ERR_NULL_PTR    Argument p_data_cfg is a NULL pointer.
 * @retval    PDC_ERR_LOCK_FUNC   The PDC has already been locked by another process.
 * @retval    PDC_ERR_INTERNAL    A module internal error was detected.
 * @retval    PDC_ERR_RST_TIMEOUT PDC reset was not canceled even after the specified amount of time elapsed.
 * @details   This function is performed to initialize the PDC. See section 3.1 in application note for details.
 * @note      This API function should be run when the device and the camera module are connected. Running this
 *            API function enables PIXCLK input and then resets the PDC, but this is because the reset will not
 *            complete if PIXCLK where the camera module output is not input to the device. If the return value
 *            PDC_ERR_RST_TIMEOUT is confirmed, check the settings and hardware configuration of the camera module.\n 
 *            An endianness setting is applied within this API function. The endianness setting should be selected
 *            to match the corresponding compiler setting. If the compiler endianness setting is little-endian, 
 *            the PDC endianness setting should be little-endian as well, and if the compiler endianness setting
 *            is big-endian, the PDC endianness setting should also be big-endian.\n 
 *            The arguments and return values of the registered callback function should be of type void.
 */
pdc_return_t R_PDC_Open (pdc_data_cfg_t *p_data_cfg)
{
    pdc_return_t ret;
    volatile bsp_int_err_t bsp_int_err;

    /* Check that the R_PDC_Open has been executed. */
    if (true == is_opened)
    {
        return PDC_ERR_OPENED;
    }

    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_data_cfg)
    {
        return PDC_ERR_NULL_PTR;
    }

    /* Locks the PDC hardware resource using the r_bsp hardware locking function. */
    if (false == R_BSP_HardwareLock((mcu_lock_t) (BSP_LOCK_PDC)))
    {
        return PDC_ERR_LOCK_FUNC;
    }

    /* Cancels PDC module stop state. */
    pdc_module_enable();
    
    /* Performs registration of callback function for PCDFI interrupt used by the PDC. */
    ppcdfi_handlers = (void *) pdc_callback_receive_data_ready;

    /* Performs registration of callback function for PCFEI interrupt used by the PDC. */
    bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_BL0_PDC_PCFEI, pdc_callback_frame_end);
    if (BSP_INT_SUCCESS != bsp_int_err)
    {
        return PDC_ERR_INTERNAL;
    }

    /* Performs registration of callback function for PCERI interrupt used by the PDC. */
    bsp_int_err = R_BSP_InterruptWrite(BSP_INT_SRC_BL0_PDC_PCERI, pdc_callback_error);
    if (BSP_INT_SUCCESS != bsp_int_err)
    {
        return PDC_ERR_INTERNAL;
    }
    
