toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
    /* Set Pointer to PCDFI, PCEFI, PCERI interrupt callback functions */
    cb_func = p_data_cfg->p_callback;
    
    /* Makes settings for interrupts used by the PDC. */
    ret = pdc_int_setting(PDC_INITIALIZE, p_data_cfg);
    if (PDC_SUCCESS != ret)
    {
        return ret;
    }

    /* Initialize for PDC */
    ret = pdc_initialize(p_data_cfg);
    if (PDC_SUCCESS != ret)
    {
        return ret;
    }

    /* PDC module is initialized successfully in R_PDC_Open. */
    is_opened = true;

    return ret;
} /* End of function R_PDC_Open() */

/**********************************************************************************************************************
 * Function Name: R_PDC_Close
 *****************************************************************************************************************/ /**
 * @brief Ends operation by the PDC and puts it into the module stop state.
 * @retval    PDC_SUCCESS      Processing finished successfully.
 * @retval    PDC_ERR_NOT_OPEN R_PDC_Open has not been run.
 * @details   This function is performed to shut down the PDC. See section 3.2 in application note for details.
 * @note      Use this API function after running R_PDC_Open and confirming that the return value is PDC_SUCCESS.
 */
pdc_return_t R_PDC_Close (void)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Check that the R_PDC_Open has been executed. */
    if (false == is_opened)
    {
        return PDC_ERR_NOT_OPEN;
    }

    /* Disables interrupts (PCFEI, PCERI, and PCDFI) used by the PDC. */
    R_BSP_InterruptRequestDisable(VECT(PDC, PCDFI));
    PDC.PCCR0.LONG &= (~0x03F0);
    /* WAIT_LOOP */
    while (0 != PDC.PCCR0.BIT.DFIE)
    {
        /* Do Nothing */
    }
    IR(PDC, PCDFI)= 0; /* Interrupt request is cleared. */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    ICU.GENBL0.BIT.EN30 = 0; /* Interrupt request(GRPBL0.IS30) is also cleared.  */
    ICU.GENBL0.BIT.EN31 = 0; /* Interrupt request(GRPBL0.IS31) is also cleared.  */
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Disables PDC operation.
     The PCCR0 register should only be set while the PCE bit in the PCCR1 register is 0. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

    /* Stops supply of parallel data transfer clock output (PCKO). */
    PDC.PCCR0.BIT.PCKOE = PDC_DISABLE_PCKO_OUTPUT;

    /* Disables pixel clock input from the image sensor. */
    PDC.PCCR0.BIT.PCKE = PDC_DISABLE_PIXCLK_INPUT;

    /* Stops PDC module. */
    pdc_module_disable();

    /* Cancels PDC hardware resource locking using the r_bsp hardware locking function. */
    R_BSP_HardwareUnlock((mcu_lock_t) (BSP_LOCK_PDC));

    /* PDC module is not initialized yet */
    is_opened = false;

    return PDC_SUCCESS;
} /* End of function R_PDC_Close() */

/**********************************************************************************************************************
 * Function Name: R_PDC_Control
 *****************************************************************************************************************/ /**
 * @brief This function performs processing according to control codes.
 * @param[in] command
 *             Control code. See section 3.3 in application note for the supported command values.
 * @param[in] *p_data_cfg
 *             Pointer to PDC settings data structure.\n 
 *             The arguments that are referenced differ according to the specified command. See section 3.3 in
 *             application note for details.
 * @param[in,out] *p_stat
 *             Pointer to PDC status structure.\n 
 *             The arguments that are referenced differ according to the specified command. See section 3.3 in
 *             application note for details.
 * @retval    PDC_SUCCESS             Processing finished successfully.
 * @retval    PDC_ERR_NOT_OPEN        R_PDC_Open has not been run.
 * @retval    PDC_ERR_INVALID_ARG     Setting value applied to PDC register is invalid.
 * @retval    PDC_ERR_INVALID_COMMAND The argument command is invalid.
 * @retval    PDC_ERR_NULL_PTR        The argument p_data_cfg or p_stat is a NULL pointer.
 * @retval    PDC_ERR_RST_TIMEOUT     PDC reset was not canceled even after the specified amount of time elapsed.
 * @details   See section 3.3 in application note for details.
 * @note      Running this API function when receive operation is in progress will overwrite the PDC registers,
 *            thereby causing receive operation to stop. Since running this API function before the frame-end interrupt
 *            is generated stops receive operation, capturing of image data is halted midway. To restart image capture,
 *            reset in the DMAC or DTC the pointer to the transfer destination in memory, then use the R_PDC_Control
 *            capture start command to restart capturing of image data.\n 
 *            When running R_PDC_Control with the command PDC_CMD_STATUS_CLR as an argument, set the status information
 *            to be cleared as "true" and the status information not to be cleared as "false". If these settings are not
 *            made before running R_PDC_Control, status information may be cleared in an unintended manner.
 */
pdc_return_t R_PDC_Control (pdc_command_t command, pdc_data_cfg_t * p_data_cfg, pdc_stat_t * p_stat)
{
    pdc_return_t ret = PDC_SUCCESS;

    /* Check that the R_PDC_Open has been executed. */
    if (false == is_opened)
    {
        return PDC_ERR_NOT_OPEN;
    }

    switch (command)
    {
        case PDC_CMD_CAPTURE_START :
            ret = pdc_capture_start();
        break;

        case PDC_CMD_CHANGE_POS_AND_SIZE :
            ret = pdc_change_position_size(p_data_cfg);
        break;

        case PDC_CMD_STATUS_GET :
            ret = pdc_get_status(p_stat);
        break;

        case PDC_CMD_STATUS_CLR :
            ret = pdc_clear_status(p_stat);
        break;

