toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
        case PDC_CMD_SET_INTERRUPT :
            ret = pdc_int_setting(PDC_CHANGE_SETTING, p_data_cfg);
        break;

        case PDC_CMD_DISABLE :
            PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;
        break;

        case PDC_CMD_ENABLE :
            PDC.PCCR1.BIT.PCE = PDC_ENABLE_OPERATION;
        break;

        case PDC_CMD_RESET :
            PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;
            ret = pdc_reset();
        break;

            /* Commands not supported */
        default :
            ret = PDC_ERR_INVALID_COMMAND;
        break;
    }
    return ret;
} /* End of function R_PDC_Control() */

/**********************************************************************************************************************
 * Function Name: R_PDC_GetFifoAddr
 *****************************************************************************************************************/ /**
 * @brief This function gets the FIFO address of the PDC.
 * @param[out] *p_fifo_addr
 *             Pointer to PDC FIFO address
 * @retval    PDC_SUCCESS      Processing finished successfully.
 * @retval    PDC_ERR_NOT_OPEN R_PDC_Open has not been run.
 * @retval    PDC_ERR_NULL_PTR Argument p_fifo_addr is a NULL pointer.
 * @details   Stores the address of the PDC receive data register (PCDR) in argument p_fifo_addr.
 * @note      None.
 */
pdc_return_t R_PDC_GetFifoAddr (uint32_t *p_fifo_addr)
{
    pdc_return_t ret = PDC_SUCCESS;

    /* Check that the R_PDC_Open has been executed. */
    if (false == is_opened)
    {
        return PDC_ERR_NOT_OPEN;
    }
    
    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if (NULL == p_fifo_addr)
    {
        return PDC_ERR_NULL_PTR;
    }

    /* Get pointer to PDC.PCDR resister address */
    *p_fifo_addr = (uint32_t)&PDC.PCDR.LONG;

    return ret;
} /* End of function R_PDC_GetFifoAddr() */

/**********************************************************************************************************************
 * Function Name: R_PDC_GetVersion
 *****************************************************************************************************************/ /**
 * @brief This function returns the API version number.
 * @return    Version number
 * @details   This function returns the version number of the currently installed PDC FIT module. The version number
 *            is encoded. The first two bytes contain the major version number and the last two bytes contain the minor
 *            version number. For example, if the version number is 4.25, the return value would be 0x00040019.
 * @note      None.
 */
uint32_t R_PDC_GetVersion (void)
{
    return ((((uint32_t) PDC_RX_VERSION_MAJOR) << 16) | ((uint32_t) PDC_RX_VERSION_MINOR));
} /* End of function R_PDC_GetVersion() */

/**
 * Private functions
 */
/***********************************************************************************************************************
 * Function Name: pdc_callback_receive_data_ready
 * Description  : Callback function of the received data ready interrupt.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
static void pdc_callback_receive_data_ready (void * pparam)
{
    pdc_cb_arg_t cb_arg;

    if ((NULL != cb_func.pcb_receive_data_ready) && (FIT_NO_FUNC != cb_func.pcb_receive_data_ready))
    {
        cb_arg.event_id = PDC_EVT_ID_DATAREADY;
        (*cb_func.pcb_receive_data_ready)((void *) &cb_arg);
    }
} /* End of function pdc_callback_receive_data_ready() */

/***********************************************************************************************************************
 * Function Name: pdc_callback_frame_end
 * Description  : Callback function of the frame end interrupt.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
static void pdc_callback_frame_end (void * pparam)
{
    pdc_cb_arg_t cb_arg;
    uint32_t timeout_count = 0;

    /* Check FIFO empty and UDRF flag. */
    do
    {
        if (PDC_SET_STATUS == PDC.PCSR.BIT.UDRF)
        {
            /* Clear the PCSR.FEF flag to 0. */
            if (PDC_SET_STATUS == PDC.PCSR.BIT.FEF)
            {
                PDC.PCSR.BIT.FEF = PDC_CLEAR_STATUS;
            }

            /* call function of error processing. */
            pdc_error_processing();
            return;
        }

        /* Check constant time is passed */
        if (timeout_count >= PDC_EMPTY_LOOP_VALUES)
        {
            /* Clear the PCSR.FEF flag to 0. */
            if (PDC_SET_STATUS == PDC.PCSR.BIT.FEF)
            {
                PDC.PCSR.BIT.FEF = PDC_CLEAR_STATUS;
            }
            
            /* Check registration frame end callback function */
            if ((NULL != cb_func.pcb_frame_end) && (FIT_NO_FUNC != cb_func.pcb_frame_end))
            {
                cb_arg.event_id = PDC_EVT_ID_TIMEOUT;
                (*cb_func.pcb_frame_end)((void *) &cb_arg);
            }
            return;
        }

        /* Increase time out counter */
        timeout_count += 1;
    } while (PDC_FIFO_NOT_EMPTY == PDC.PCSR.BIT.FEMPF);        /* WAIT_LOOP */

    /* After completion of the transfer, clear the PCE bit in the PCCR1 register to 0. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

    /* Clear the FEF flag in the PCSR register to 0. */
    if (PDC_SET_STATUS == PDC.PCSR.BIT.FEF)
    {
        PDC.PCSR.BIT.FEF = PDC_CLEAR_STATUS;
    }

    /* Check registration callback function for frame end interrupt */
    if ((NULL != cb_func.pcb_frame_end) && (FIT_NO_FUNC != cb_func.pcb_frame_end))
    {
        cb_arg.event_id = PDC_EVT_ID_FRAMEEND;
        (*cb_func.pcb_frame_end)((void *) &cb_arg);
    }

} /* End of function pdc_callback_frame_end() */

