toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
/***********************************************************************************************************************
 * Function Name: pdc_callback_error
 * Description  : Callback function of the error interrupt.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
static void pdc_callback_error (void * pparam)
{
    /* call function of error processing. */
    pdc_error_processing();
} /* End of function pdc_callback_error() */

/***********************************************************************************************************************
 * Function Name: pdc_error_processing
 * Description  : error processing.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
static void pdc_error_processing (void)
{
    pdc_cb_arg_t cb_arg;

    /* Disabling of PDC operation. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

    /* Check registration callback function for error interrupt */
    if ((NULL != cb_func.pcb_error) && (FIT_NO_FUNC != cb_func.pcb_error))
    {
        cb_arg.event_id = PDC_EVT_ID_ERROR;
        (*cb_func.pcb_error)((void *) &cb_arg);
    }

    /* Checking the overrun flag.(PCSR.OVRF) */
    if (PDC_SET_STATUS == PDC.PCSR.BIT.OVRF)
    {
        /* Check registration callback function for error interrupt */
        if ((NULL != cb_func.pcb_error) && (FIT_NO_FUNC != cb_func.pcb_error))
        {
            cb_arg.event_id = PDC_EVT_ID_OVERRUN;
            (*cb_func.pcb_error)((void *) &cb_arg);
        }

        /* Clear the PCSR.OVRF flag to 0. */
        PDC.PCSR.BIT.OVRF = PDC_CLEAR_STATUS;
    }

    /* Checking the underrun flag.(PCSR.UDRF) */
    if (PDC_SET_STATUS == PDC.PCSR.BIT.UDRF)
    {
        /* Check registration callback function for error interrupt */
        if ((NULL != cb_func.pcb_error) && (FIT_NO_FUNC != cb_func.pcb_error))
        {
            cb_arg.event_id = PDC_EVT_ID_UNDERRUN;
            (*cb_func.pcb_error)((void *) &cb_arg);
        }

        /* Clear the PCSR.UDRF flag to 0. */
        PDC.PCSR.BIT.UDRF = PDC_CLEAR_STATUS;
    }

    /* Checking the vertical line setting error flag.(PCSR.VERF) */
    if (PDC_SET_STATUS == PDC.PCSR.BIT.VERF)
    {
        /* Check registration callback function for error interrupt */
        if ((NULL != cb_func.pcb_error) && (FIT_NO_FUNC != cb_func.pcb_error))
        {
            cb_arg.event_id = PDC_EVT_ID_VERTICALLINE;
            (*cb_func.pcb_error)((void *) &cb_arg);
        }

        /* Clear the PCSR.VERF flag to 0. */
        PDC.PCSR.BIT.VERF = PDC_CLEAR_STATUS;
    }

    /* Checking the horizontal byte setting error flag.(PCSR.HERF) */
    if (PDC_SET_STATUS == PDC.PCSR.BIT.HERF)
    {
        /* Check registration callback function for error interrupt */
        if ((NULL != cb_func.pcb_error) && (FIT_NO_FUNC != cb_func.pcb_error))
        {
            cb_arg.event_id = PDC_EVT_ID_HORIZONTALBYTE;
            (*cb_func.pcb_error)((void *) &cb_arg);
        }

        /* Clear the PCSR.HERF flag to 0. */
        PDC.PCSR.BIT.HERF = PDC_CLEAR_STATUS;
    }

    /* Checking the underrun flag.(PCSR.UDRF) */
    if (PDC_SET_STATUS == PDC.PCSR.BIT.UDRF)
    {
        /* Check registration callback function for error interrupt */
        if ((NULL != cb_func.pcb_error) && (FIT_NO_FUNC != cb_func.pcb_error))
        {
            cb_arg.event_id = PDC_EVT_ID_UNDERRUN;
            (*cb_func.pcb_error)((void *) &cb_arg);
        }

        /* Clear the PCSR.UDRF flag to 0. */
        PDC.PCSR.BIT.UDRF = PDC_CLEAR_STATUS;
    }
} /* End of function pdc_error_processing() */

/***********************************************************************************************************************
 * Function Name: pdc_reset
 * Description  : Initialize internal state and PCSR resister in PDC.
 * Arguments    : none
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_RST_TIMEOUT -
 *                    PDC is resetting after constant time is passed.
 ***********************************************************************************************************************/
static pdc_return_t pdc_reset (void)
{
    uint32_t timeout_count = 0;

    /* Start reset of PDC */
    PDC.PCCR0.BIT.PRST = PDC_RESET;

    /* Check reset release in PDC */
    /* WAIT_LOOP */
    while (PDC_RESET_RELEASE != PDC.PCCR0.BIT.PRST)
    {
        /* Check constant time is passed */
        if (timeout_count >= PDC_RESET_LOOP_VALUES)
        {
            return PDC_ERR_RST_TIMEOUT;
        }

        /* Increase time out counter */
        timeout_count += 1;
    }
    
    timeout_count = 0;

    /* Wait for continuous reset limitation */
    /* WAIT_LOOP */
    while (timeout_count <= PDC_CONT_RESET_LOOP_VALUES)
    {
        /* Increase time out counter */
        timeout_count += 1;
    }

    return PDC_SUCCESS;
} /* End of function pdc_reset() */

/***********************************************************************************************************************
 * Function Name: pdc_int_setting
 * Description  : Makes settings for interrupts used by the PDC.
 * Arguments    : step -
 *                    Which step in setting interrupt
 *                p_data_cfg -
 *                    Pointer to PDC settings data structure
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_INVALID_ARG -
 *                    Parameter values in PDC setting information are invalid.
 *                PDC_ERR_NULL_PTR -
 *                    Argument p_data_cfg is a NULL pointer.
 ***********************************************************************************************************************/
static pdc_return_t pdc_int_setting (pdc_step_t step, pdc_data_cfg_t *p_data_cfg)
{
    pdc_return_t ret;
    pdc_data_cfg_t pcfg_data;

    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_data_cfg)
    {
        return PDC_ERR_NULL_PTR;
    }

    switch (step)
    {
        case PDC_INITIALIZE :

            /* Make sure that the argument is correct. */
            pcfg_data.iupd_select = PDC_ALL_INT_UPDATE;

            /* Set the PCDFI interrupt priority level. */
            pcfg_data.priority.pcdfi_level = p_data_cfg->priority.pcdfi_level;

            pcfg_data.inticu_req = p_data_cfg->inticu_req;
            pcfg_data.intpdc_req = p_data_cfg->intpdc_req;

            if ((true == p_data_cfg->inticu_req.pcfei_ien) || (true == p_data_cfg->inticu_req.pceri_ien))
            {
                /* Set the GROUPBL0 interrupt priority level. */
                pcfg_data.priority.groupbl0_level = p_data_cfg->priority.groupbl0_level;
            }
            else
            {
                /* Remove GROUPBL0 interrupt priority level from update select */
                pcfg_data.iupd_select &= (~PDC_GROUPBL0_IPR_UPDATE);
            }

            /* call function of interrupt setting. */
            ret = pdc_int_setting_sub(&pcfg_data);
        break;

        case PDC_CHANGE_SETTING :

            /* call function of interrupt setting. */
            ret = pdc_int_setting_sub(p_data_cfg);
        break;

            /* Illegal step is not supported */
        default :
            ret = PDC_ERR_INVALID_ARG;
        break;
    }
    return ret;
} /* End of function pdc_int_setting() */

