toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
/***********************************************************************************************************************
 * Function Name: pdc_int_setting_sub
 * Description  : Makes settings for interrupts used by the PDC.
 * Arguments    : p_data_cfg -
 *                    Pointer to PDC settings data structure
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_INVALID_ARG -
 *                    Parameter values in PDC setting information are invalid.
 *                PDC_ERR_NULL_PTR -
 *                    Argument p_data_cfg is a NULL pointer.
 ***********************************************************************************************************************/
static pdc_return_t pdc_int_setting_sub (pdc_data_cfg_t *p_data_cfg)
{
    bsp_int_ctrl_t grpbl0;
    
    /* Initialize local variable */
    grpbl0.ipl = 0;
    
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_data_cfg)
    {
        return PDC_ERR_NULL_PTR;
    }
    
    /* Set the GROUPBL0 interrupt priority level. */
    grpbl0.ipl = p_data_cfg->priority.groupbl0_level;
    
    if (PDC_PCDFI_IPR_UPDATE == (p_data_cfg->iupd_select & PDC_PCDFI_IPR_UPDATE))
    {
        /* Check the argument. When the argument is correct, set the PCDFI interrupt priority level. */
        if (PDC_IPR_LV_UPPER_LIMIT < p_data_cfg->priority.pcdfi_level)
        {
            return PDC_ERR_INVALID_ARG;
        }
        IPR(PDC, PCDFI)= p_data_cfg->priority.pcdfi_level;
    }

    if (PDC_GROUPBL0_IPR_UPDATE == (p_data_cfg->iupd_select & PDC_GROUPBL0_IPR_UPDATE))
    {
        /* Check the argument. When the argument is correct, set the GROUPBL0 interrupt priority level. */
        if (PDC_IPR_LV_UPPER_LIMIT < grpbl0.ipl)
        {
            return PDC_ERR_INVALID_ARG;
        }
        R_BSP_InterruptControl(BSP_INT_SRC_BL0_PDC_PCFEI, BSP_INT_CMD_GROUP_INTERRUPT_ENABLE,
                (void *) &grpbl0.ipl);
    }

    if (PDC_PCFEI_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_PCFEI_IEN_UPDATE))
    {
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        ICU.GENBL0.BIT.EN30 = 0; /* Interrupt request(GRPBL0.IS30) is also cleared.  */
        ICU.GENBL0.BIT.EN30 = p_data_cfg->inticu_req.pcfei_ien;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    }

    if (PDC_PCERI_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_PCERI_IEN_UPDATE))
    {
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        ICU.GENBL0.BIT.EN31 = 0; /* Interrupt request(GRPBL0.IS31) is also cleared.  */
        ICU.GENBL0.BIT.EN31 = p_data_cfg->inticu_req.pceri_ien;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    }

    if (PDC_PCDFI_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_PCDFI_IEN_UPDATE))
    {
        IR(PDC, PCDFI)= 0; /* Interrupt request is cleared. */
        if (1 == p_data_cfg->inticu_req.pcdfi_ien)
        {
            R_BSP_InterruptRequestEnable(VECT(PDC, PCDFI));
        }
        else
        {
            R_BSP_InterruptRequestDisable(VECT(PDC, PCDFI));
        }
    }

    /* The PCCR0 register should only be set while the PCE bit in the PCCR1 register is 0. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

    if (PDC_DFIE_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_DFIE_IEN_UPDATE))
    {
        PDC.PCCR0.BIT.DFIE = p_data_cfg->intpdc_req.dfie_ien;
    }

    if (PDC_FEIE_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_FEIE_IEN_UPDATE))
    {
        PDC.PCCR0.BIT.FEIE = p_data_cfg->intpdc_req.feie_ien;
    }

    if (PDC_OVIE_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_OVIE_IEN_UPDATE))
    {
        PDC.PCCR0.BIT.OVIE = p_data_cfg->intpdc_req.ovie_ien;
    }

    if (PDC_UDRIE_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_UDRIE_IEN_UPDATE))
    {
        PDC.PCCR0.BIT.UDRIE = p_data_cfg->intpdc_req.udrie_ien;
    }

    if (PDC_VERIE_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_VERIE_IEN_UPDATE))
    {
        PDC.PCCR0.BIT.VERIE = p_data_cfg->intpdc_req.verie_ien;
    }

    if (PDC_HERIE_IEN_UPDATE == (p_data_cfg->iupd_select & PDC_HERIE_IEN_UPDATE))
    {
        PDC.PCCR0.BIT.HERIE = p_data_cfg->intpdc_req.herie_ien;
    }
    return PDC_SUCCESS;
} /* End of function pdc_int_setting_sub() */

/***********************************************************************************************************************
 * Function Name: pdc_initialize
 * Description  : Makes initial settings for using the PDC.
 * Arguments    : p_data_cfg -
 *                    Pointer to PDC settings data structure
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_INVALID_ARG -
 *                    Argument p_data_cfg is a NULL pointer.
 ***********************************************************************************************************************/
static pdc_return_t pdc_initialize (pdc_data_cfg_t *p_data_cfg)
{
    pdc_return_t ret;
    uint16_t value;
    uint16_t pckdiv_value;

    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_data_cfg)
    {
        return PDC_ERR_NULL_PTR;
    }

    if (PDC_VST_UPPER_LIMIT < p_data_cfg->capture_pos.vst_position)
    {
        return PDC_ERR_INVALID_ARG;
    }

    if (PDC_HST_UPPER_LIMIT < p_data_cfg->capture_pos.hst_position)
    {
        return PDC_ERR_INVALID_ARG;
    }

    if ((PDC_VSZ_LOWER_LIMIT > p_data_cfg->capture_size.vsz_size)
            || (PDC_VSZ_UPPER_LIMIT < p_data_cfg->capture_size.vsz_size))
    {
        return PDC_ERR_INVALID_ARG;
    }

    if ((PDC_HSZ_LOWER_LIMIT > p_data_cfg->capture_size.hsz_size)
            || (PDC_HSZ_UPPER_LIMIT < p_data_cfg->capture_size.hsz_size))
    {
        return PDC_ERR_INVALID_ARG;
    }

    /* The range of values that dealt with in the register is 12-bit.
     Value obtained by adding the 12-bit to 12-bit is 16 bits or less.
     Because the information is not lost within the range to be handled, can be cast. */
    value = (uint16_t) (p_data_cfg->capture_pos.vst_position + p_data_cfg->capture_size.vsz_size);
    if (PDC_VSTVSZ_MIX_UPPER_LIMIT < value)
    {
        return PDC_ERR_INVALID_ARG;
    }

    /* The range of values that dealt with in the register is 12-bit.
     Value obtained by adding the 12-bit to 12-bit is 16 bits or less.
     Because the information is not lost within the range to be handled, can be cast. */
    value = (uint16_t) (p_data_cfg->capture_pos.hst_position + p_data_cfg->capture_size.hsz_size);
    if (PDC_HSTHSZ_MIX_UPPER_LIMIT < value)
    {
        return PDC_ERR_INVALID_ARG;
    }

    /* The PCCR0 register should only be set while the PCE bit in the PCCR1 register is 0.
     The VCR register should be set while the PCE bit in the PCCR1 register is 0.
     The HCR register should be set while the PCE bit in the PCCR1 register is 0. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

    /* Calculate PCKO frequency division ratio */
    pckdiv_value = ((PDC_CFG_PCKO_DIV / 2) - 1);

    /* Set PCKO frequency division ratio */
    PDC.PCCR0.BIT.PCKDIV = pckdiv_value;

