toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
    /* Enables PCKO output */
    PDC.PCCR0.BIT.PCKOE = PDC_ENABLE_PCKO_OUTPUT;

    /* Enables PIXCLK input. */
    PDC.PCCR0.BIT.PCKE = PDC_ENABLE_PIXCLK_INPUT;

    /* Resets the PDC. */
    ret = pdc_reset();
    if (PDC_SUCCESS != ret)
    {
        return ret;
    }

    /* Sets the vertical and horizontal capture ranges. */
    PDC.VCR.BIT.VST = p_data_cfg->capture_pos.vst_position;
    PDC.HCR.BIT.HST = p_data_cfg->capture_pos.hst_position;

    PDC.VCR.BIT.VSZ = p_data_cfg->capture_size.vsz_size;
    PDC.HCR.BIT.HSZ = p_data_cfg->capture_size.hsz_size;

    /* Sets the VSYNC and HSYNC signal polarity. */
    PDC.PCCR0.BIT.VPS = p_data_cfg->vps_select;
    PDC.PCCR0.BIT.HPS = p_data_cfg->hps_select;

    /* Sets the endianness. */
#if (defined(__BIG) || defined(__RX_BIG_ENDIAN__))
    PDC.PCCR0.BIT.EDS = PDC_EDS_BIG_ENDIAN;
#else
    PDC.PCCR0.BIT.EDS = PDC_EDS_LITTLE_ENDIAN;
#endif

    return ret;
} /* End of function pdc_initialize() */

/***********************************************************************************************************************
 * Function Name: pdc_capture_start
 * Description  : After resetting interrupt settings and the PDC, enables PDC receive operation to start data capture.
 * Arguments    : none
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_RST_TIMEOUT -
 *                    PDC is resetting after constant time is passed.
 ***********************************************************************************************************************/
static pdc_return_t pdc_capture_start (void)
{
    pdc_return_t ret;
    uint32_t value;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* The PCCR0 register should only be set while the PCE bit in the PCCR1 register is 0. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

    /* Internal interrupt request is cleared. */
    value = PDC.PCCR0.LONG;
    PDC.PCCR0.BIT.DFIE = 0;
    PDC.PCCR0.BIT.FEIE = 0;
    PDC.PCCR0.BIT.OVIE = 0;
    PDC.PCCR0.BIT.UDRIE = 0;
    PDC.PCCR0.BIT.VERIE = 0;
    PDC.PCCR0.BIT.HERIE = 0;
    value &= 0x000007F0;
    PDC.PCCR0.LONG |= value;
    IR(PDC, PCDFI)= 0; /* Interrupt request is cleared. */
    if (1 == ICU.GENBL0.BIT.EN30)
    {
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        ICU.GENBL0.BIT.EN30 = 0; /* Interrupt request(GRPBL0.IS30) is also cleared.  */
        ICU.GENBL0.BIT.EN30 = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    }
    if (1 == ICU.GENBL0.BIT.EN31)
    {
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
        ICU.GENBL0.BIT.EN31 = 0; /* Interrupt request(GRPBL0.IS31) is also cleared.  */
        ICU.GENBL0.BIT.EN31 = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
        R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    }

    /* Resets the PDC. */
    ret = pdc_reset();
    if (PDC_SUCCESS == ret)
    {
        /* Enabling of PDC operation. */
        PDC.PCCR1.BIT.PCE = PDC_ENABLE_OPERATION;
    }

    return ret;
} /* End of function pdc_capture_start() */

/***********************************************************************************************************************
 * Function Name: pdc_change_position_size
 * Description  : Resets the capture start position and size settings.
 * Arguments    : p_data_cfg -
 *                    Pointer to PDC settings data structure
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_INVALID_ARG -
 *                    Parameter values in PDC setting information are invalid.
 *                PDC_ERR_NULL_PTR -
 *                    Argument p_data_cfg is a NULL pointer.
 ***********************************************************************************************************************/
static pdc_return_t pdc_change_position_size (pdc_data_cfg_t *p_data_cfg)
{
    uint16_t value;

    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_data_cfg)
    {
        return PDC_ERR_NULL_PTR;
    }

    if (PDC_VST_UPPER_LIMIT < p_data_cfg->capture_pos.vst_position)
    {
        return PDC_ERR_INVALID_ARG;
    }

    if (PDC_HST_UPPER_LIMIT < p_data_cfg->capture_pos.hst_position)
    {
        return PDC_ERR_INVALID_ARG;
    }

    if ((PDC_VSZ_LOWER_LIMIT > p_data_cfg->capture_size.vsz_size)
            || (PDC_VSZ_UPPER_LIMIT < p_data_cfg->capture_size.vsz_size))
    {
        return PDC_ERR_INVALID_ARG;
    }

    if ((PDC_HSZ_LOWER_LIMIT > p_data_cfg->capture_size.hsz_size)
            || (PDC_HSZ_UPPER_LIMIT < p_data_cfg->capture_size.hsz_size))
    {
        return PDC_ERR_INVALID_ARG;
    }

    /* The range of values that dealt with in the register is 12-bit.
     Value obtained by adding the 12-bit to 12-bit is 16 bits or less.
     Because the information is not lost within the range to be handled, can be cast. */
    value = (uint16_t) (p_data_cfg->capture_pos.vst_position + p_data_cfg->capture_size.vsz_size);
    if (PDC_VSTVSZ_MIX_UPPER_LIMIT < value)
    {
        return PDC_ERR_INVALID_ARG;
    }

    /* The range of values that dealt with in the register is 12-bit.
     Value obtained by adding the 12-bit to 12-bit is 16 bits or less.
     Because the information is not lost within the range to be handled, can be cast. */
    value = (uint16_t) (p_data_cfg->capture_pos.hst_position + p_data_cfg->capture_size.hsz_size);
    if (PDC_HSTHSZ_MIX_UPPER_LIMIT < value)
    {
        return PDC_ERR_INVALID_ARG;
    }

    /* The VCR register should be set while the PCE bit in the PCCR1 register is 0.
     The HCR register should be set while the PCE bit in the PCCR1 register is 0. */
    PDC.PCCR1.BIT.PCE = PDC_DISABLE_OPERATION;

