toshiyuki-umetsu-cosmosweb/rx72n_pdc_sample/src/smc_gen/r_pdc_rx/src/r_pdc_rx.c
    /* Sets the vertical and horizontal capture ranges. */
    PDC.VCR.BIT.VST = p_data_cfg->capture_pos.vst_position;
    PDC.HCR.BIT.HST = p_data_cfg->capture_pos.hst_position;

    PDC.VCR.BIT.VSZ = p_data_cfg->capture_size.vsz_size;
    PDC.HCR.BIT.HSZ = p_data_cfg->capture_size.hsz_size;

    return PDC_SUCCESS;
} /* End of function pdc_change_position_size() */

/***********************************************************************************************************************
 * Function Name: pdc_clear_status
 * Description  : Clears PDC status information indicated by argument p_stat.
 * Arguments    : p_stat -
 *                    Pointer to PDC status structure
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_NULL_PTR -
 *                    The argument p_data_cfg or p_stat is a NULL pointer.
 ***********************************************************************************************************************/
static pdc_return_t pdc_clear_status (pdc_stat_t *p_stat)
{
    volatile uint32_t read_data;

    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_stat)
    {
        return PDC_ERR_NULL_PTR;
    }

    /* Read PCSR resister */
    read_data = PDC.PCSR.LONG;

    /* Clear PDC Status Register(PCSR). */
    if (true == p_stat->pcsr_stat.frame_end)
    {
        PDC.PCSR.BIT.FEF = 0;
    }
    if (true == p_stat->pcsr_stat.overrun)
    {
        PDC.PCSR.BIT.OVRF = 0;
    }
    if (true == p_stat->pcsr_stat.underrun)
    {
        PDC.PCSR.BIT.UDRF = 0;
    }
    if (true == p_stat->pcsr_stat.verf_error)
    {
        PDC.PCSR.BIT.VERF = 0;
    }
    if (true == p_stat->pcsr_stat.herf_error)
    {
        PDC.PCSR.BIT.HERF = 0;
    }
    return PDC_SUCCESS;
} /* End of function pdc_clear_status() */

/***********************************************************************************************************************
 * Function Name: pdc_get_status
 * Description  : Writes PDC status information to the pointer position indicated by argument p_stat.
 * Arguments    : p_stat -
 *                    Pointer to PDC status structure
 * Return Values: PDC_SUCCESS -
 *                    Processing finished successfully.
 *                PDC_ERR_NULL_PTR -
 *                    The argument p_data_cfg or p_stat is a NULL pointer.
 ***********************************************************************************************************************/
static pdc_return_t pdc_get_status (pdc_stat_t *p_stat)
{
    /* Make sure that the argument is correct. */
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if ((uint32_t) NULL == (uint32_t) p_stat)
    {
        return PDC_ERR_NULL_PTR;
    }

    /* Read the PDC Status Register(PCSR). */
    /* Since the value of the register is defined by the BIT, the value to be handled is 1 or 0.
     Because the information is not lost even if the cast to bool, it is okay to cast. */
    p_stat->pcsr_stat.frame_busy = (bool) PDC.PCSR.BIT.FBSY;
    p_stat->pcsr_stat.fifo_empty = (bool) PDC.PCSR.BIT.FEMPF;
    p_stat->pcsr_stat.frame_end = (bool) PDC.PCSR.BIT.FEF;
    p_stat->pcsr_stat.overrun = (bool) PDC.PCSR.BIT.OVRF;
    p_stat->pcsr_stat.underrun = (bool) PDC.PCSR.BIT.UDRF;
    p_stat->pcsr_stat.verf_error = (bool) PDC.PCSR.BIT.VERF;
    p_stat->pcsr_stat.herf_error = (bool) PDC.PCSR.BIT.HERF;

    /* Read the PDC Pin Monitor Register(PCMONR). */
    /* Since the value of the register is defined by the BIT, the value to be handled is 1 or 0.
     Because the information is not lost even if the cast to bool, it is okay to cast. */
    p_stat->pcmonr_stat.vsync = (bool) PDC.PCMONR.BIT.VSYNC;
    p_stat->pcmonr_stat.hsync = (bool) PDC.PCMONR.BIT.HSYNC;

    return PDC_SUCCESS;
} /* End of function pdc_get_status() */

/***********************************************************************************************************************
 * Function Name: pdc_module_enable
 * Description  : Cancels PDC module stop state.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
static void pdc_module_enable (void)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif
    /* Enable writing to MSTP registers. And release from the module-stop state of PDC.
     After that disable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    MSTP( PDC ) = 0;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

} /* End of function pdc_module_enable() */

/***********************************************************************************************************************
 * Function Name: pdc_module_disable
 * Description  : Stops PDC module.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
static void pdc_module_disable (void)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif
    /* Enable writing to MSTP registers and stop module of PDC.
     After that disable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif
    MSTP( PDC ) = 1;
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

} /* End of function pdc_module_disable() */

/***********************************************************************************************************************
 * Outline      : Interrupt PCDFI handler
 * Function Name: pdc_pcdfi_isr
 * Description  : Types of interrupt requests from receive data ready(PCDFI).
 *                If the pointer to function is FIT_NO_FUNC or NULL,
 *                You should write a program under "do something" in this
 *                pdc_pcdfi_isr function.
 * Arguments    : none
 * Return Values: none
 ***********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(pdc_pcdfi_isr, VECT(PDC, PCDFI))
R_BSP_ATTRIB_STATIC_INTERRUPT void pdc_pcdfi_isr(void)
{
    /* To cast in order to compare the address. There is no problem because the information is not lost even if the
     *  cast. */
    if (((uint32_t) NULL != (uint32_t) ppcdfi_handlers) && ((uint32_t) FIT_NO_FUNC != (uint32_t) ppcdfi_handlers))
    {
        ((pcdfi_callback_t) ppcdfi_handlers)((void *) NULL);
    }
    else
    {
        /* do something */
    }
} /* End of function pdc_pcdfi_isr() */

/* End of File */
